<a href="https://colab.research.google.com/github/JakeOh/202011_itw_bd21/blob/main/lab_da/da13_concat.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

# pandas.Series의 concat

In [3]:
s1 = pd.Series(data=[1, 2], index=['a', 'b'])
s1

a    1
b    2
dtype: int64

In [4]:
s2 = pd.Series(data=[3, 4, 5], index=['c', 'd', 'e'])
s2

c    3
d    4
e    5
dtype: int64

In [5]:
result = pd.concat([s1, s2], axis=0)  # axis의 기본값은 0이기 때문에 생략 가능.
result  #> Series

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
result = pd.concat([s1, s2], axis=1)
result  #> DataFrame

     0    1
a  1.0  NaN
b  2.0  NaN
c  NaN  3.0
d  NaN  4.0
e  NaN  5.0

In [7]:
s1

a    1
b    2
dtype: int64

In [8]:
s2 = pd.Series(data=[3, 4, 5], index=['a', 'b', 'c'])
s2

a    3
b    4
c    5
dtype: int64

In [9]:
pd.concat([s1, s2], axis=0)

a    1
b    2
a    3
b    4
c    5
dtype: int64

In [10]:
pd.concat([s1, s2], axis=1)

     0  1
a  1.0  3
b  2.0  4
c  NaN  5

# pandas.DataFrame의 concat

In [11]:
df1 = pd.DataFrame(data=np.arange(6).reshape((3, 2)),
                   index=['a', 'b', 'c'],
                   columns=['data1', 'data2'])
df1

   data1  data2
a      0      1
b      2      3
c      4      5

In [13]:
df2 = pd.DataFrame(data=np.arange(4).reshape((2, 2)),
                   index=['a', 'c'],
                   columns=['data2', 'data3'])
df2

   data2  data3
a      0      1
c      2      3

In [14]:
pd.concat([df1, df2], axis=0)

   data1  data2  data3
a    0.0      1    NaN
b    2.0      3    NaN
c    4.0      5    NaN
a    NaN      0    1.0
c    NaN      2    3.0

In [15]:
pd.concat([df1, df2], axis=1)

   data1  data2  data2  data3
a      0      1    0.0    1.0
b      2      3    NaN    NaN
c      4      5    2.0    3.0

https://github.com/wesm/pydata-book/tree/2nd-edition/datasets/babynames 폴더에는 yob1880.txt ~ yob2010.txt 파일들이 있음. 파일에는 연도의 신생아 이름, 성별, 인구수가 기록되어 있음.

1. 텍스트 파일을 하나씩 읽어서 데이터 프레임을 생성
2. 각 데이터 프레임에 year 컬럼을 추가
3. 131개의 데이터 프레임을 하나의 데이터 프레임으로 병합(concat)